ERP.belugaerp/src/Documents/ВнутреннееПотреблениеТоваров/ВнутреннееПотреблениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВнутреннееПотреблениеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностямВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностям</registerRecords>
  <attributes>
    <name>бг_РазрешитьПараллельнуюСборку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИнвентаризацияПродукцииЕГАИС</name>
    <type>
      <types>DocumentRef.битИнвентаризацияПродукцииЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СписаниеПотерь</name>
    <type>
      <types>DocumentRef.битСписаниеПотерь</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СписаниеНормативныхПотерьПоАкцизам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>бг_СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КатегорияЭксплуатации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_АкцизПоПриобретеннымЦенностям</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/InformationRegisters/бг_НалогообложениеАкцизомОрганизаций/бг_НалогообложениеАкцизомОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_НалогообложениеАкцизомОрганизаций</name>
  <resources>
    <name>ВидОперацииНалогообложения</name>
    <type>
      <types>CatalogRef.бг_ВидыОперацийНалогообложенияАкцизом</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусАкциза</name>
    <type>
      <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеСырья</name>
    <type>
      <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусНачисленияАванса</name>
    <type>
      <types>EnumRef.бг_СтатусыНачисленияАвансов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПродажаНаЭкспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/бг_СостоянияПодакцизногоСырья/бг_СостоянияПодакцизногоСырья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_СостоянияПодакцизногоСырья</name>
  <enumValues>
    <name>ВМестахХранения</name>
  </enumValues>
  <enumValues>
    <name>ВГотовойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ВСпиртосодержащейСмеси</name>
  </enumValues>
  <enumValues>
    <name>ВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ВозвращеноПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспорта</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспортаЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспортаГарантии</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВРеализованнойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ВРеализованнойПродукцииЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВРеализованнойПродукцииЭкспортКромеЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВСписанныхМПЗПоНорме</name>
  </enumValues>
  <enumValues>
    <name>ВСписанныхМПЗСверхНормы</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспортЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспортГарантии</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспортЕАЭСГарантии</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/ВнутреннееПотреблениеТоваров/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

#Область ПроводкиРеглУчета

&Вместо("ТекстОтраженияВРеглУчете")
Функция бг_ТекстОтраженияВРеглУчете()
	
	ТекстЗапроса = ПродолжитьВызов();
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + 
	ТекстОтраженияНачисленияАкциза();
	
	Возврат ТекстЗапроса;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстОтраженияНачисленияАкциза()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	СУММА(Строки.бг_СуммаАкциза) КАК Сумма,
	|	СУММА(Строки.бг_СуммаАкциза) КАК СуммаУУ,
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Операция.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы) КАК СчетДт,
	|	НалогообложениеАкцизомОрганизаций.ВидОперацииНалогообложения.СтатьяРасхода КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	СУММА(ВЫБОР КОГДА НалогообложениеАкцизомОрганизаций.ВидОперацииНалогообложения.СтатьяРасхода <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		 И НЕ НалогообложениеАкцизомОрганизаций.ВидОперацииНалогообложения.СтатьяРасхода.ПринятиеКНалоговомуУчету
	|		ТОГДА 0
	|		ИНАЧЕ Строки.бг_СуммаАкциза
	|	КОНЕЦ) КАК СуммаНУДт,
	|	СУММА(ВЫБОР КОГДА НалогообложениеАкцизомОрганизаций.ВидОперацииНалогообложения.СтатьяРасхода <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		 И НЕ НалогообложениеАкцизомОрганизаций.ВидОперацииНалогообложения.СтатьяРасхода.ПринятиеКНалоговомуУчету
	|		ТОГДА Строки.бг_СуммаАкциза
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Акцизы) КАК СчетКт,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	Операция.Организация.РегистрацияВНалоговомОргане КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Начисление акциза"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров КАК Операция
	|		ПО ДокументыКОтражению.Ссылка = Операция.Ссылка
	|			И Операция.Дата >= Операция.Организация.бг_ДатаНачалаУчетаАкцизовПоПриобретеннымЦенностям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотреблениеТоваров.Товары КАК Строки
	|		ПО (Строки.Ссылка = Операция.Ссылка) И Строки.бг_СуммаАкциза <> 0 
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бг_НалогообложениеАкцизомОрганизаций КАК НалогообложениеАкцизомОрганизаций
	|		ПО (Операция.Организация = НалогообложениеАкцизомОрганизаций.Организация)
	|			И (НалогообложениеАкцизомОрганизаций.СтатусАкциза = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияОплатыВходящегоАкциза.ПустаяСсылка))
	|			И (НалогообложениеАкцизомОрганизаций.СостояниеСырья = ЗНАЧЕНИЕ(Перечисление.бг_СостоянияПодакцизногоСырья.ВСписанныхМПЗПоНорме))
	|			И (НалогообложениеАкцизомОрганизаций.СтатусНачисленияАванса = ЗНАЧЕНИЕ(Перечисление.бг_СтатусыНачисленияАвансов.ПустаяСсылка))
	|			И (НЕ НалогообложениеАкцизомОрганизаций.ПродажаНаЭкспорт)
	|			И (НалогообложениеАкцизомОрганизаций.Номенклатура В (Строки.Номенклатура, Строки.Номенклатура.ВидНоменклатуры))
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	Операция.Дата,
	|	Операция.Организация,
	|	Операция.Подразделение,
	|	НалогообложениеАкцизомОрганизаций.ВидОперацииНалогообложения.СтатьяРасхода
	|";
	
	Возврат ТекстЗапроса;

КонецФункции 

&Перед("ДобавитьКомандыПечати")
Процедура бг_ДобавитьКомандыПечати(КомандыПечати)
	
	Если ПравоДоступа("Использование", Метаданные.Обработки.бг_ПечатьТОРГ16_ВнутреннееПотреблениеТоваров) Тогда
		Обработки.бг_ПечатьТОРГ16_ВнутреннееПотреблениеТоваров.ДобавитьКомандуПечати(КомандыПечати);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
